[
  {
    "page": "Home",
    "title": "Angular Tools — Free Tools for Angular Developers",
    "description": "A collection of free Angular tools including notification service, form error helper, multi-theme engine, tree view component, step wizard, and smart Bootstrap table.",
    "keywords": "angular tools, free angular tools, angular components, angular utilities, angular plugins, angular examples, angular demo tools, frontend development tools"
  },
  {
    "page": "Notification",
    "title": "Free Angular Notification Service | Alert Utility",
    "description": "Use the free Notification Tool to quickly add toast messages, alerts, and success/error notifications in your Angular application.",
    "keywords": "angular notification, angular toast, angular alert service, notification component angular, toast service angular, alert message angular, angular ui notifications"
  },
  {
    "page": "FormError",
    "title": "Angular Form Error Display Tool | Automatic Validation Messages",
    "description": "A simple tool that auto-displays Angular form errors with clean UI, supporting validation rules.",
    "keywords": "angular form error, reactive form errors, form validation angular, angular error messages, validation messages angular, angular form helper, angular form validation tool"
  },
  {
    "page": "Multi-Theme",
    "title": "Angular Multi-Theme Tool | Dynamic custom Theme Switcher",
    "description": "Add multiple themes to your Angular project easily with this free multi-theme switching tool.",
    "keywords": "angular theme switcher, angular dark mode, angular multi theme, theme service angular, light dark theme angular, angular dynamic theming, css theme angular"
  },
  {
    "page": "TreeView",
    "title": "Angular Tree View Component | Expand/Collapse + Checkbox Support",
    "description": "Free Angular TreeView tool with expandable nodes, checkbox selection, filtering, and hierarchical parent–child state management.",
    "keywords": "angular tree view, angular treeview component, checkbox tree angular, hierarchical tree angular, expandable tree angular, nested list angular, angular ui tree"
  },
  {
    "page": "step-wizard",
    "title": "Angular Step Wizard Component | Multi-Step Form Navigation",
    "description": "Easily create multi-step forms or guided wizards in Angular with this free step wizard UI tool",
    "keywords": "angular step wizard, angular wizard component, multi step form angular, angular stepper, angular form wizard, angular steps ui, guided steps angular"
  },
  {
    "page": "smart-table",
    "title": "Bootstrap Smart Table for Angular",
    "description": "A smart Angular table with column hide/show, resizing, and drag-and-drop reordering",
    "keywords": "angular smart table, angular table component, bootstrap table angular, angular sortable table, angular filter table, data table angular, column reorder angular"
  },
  {
    "page": "smart-panel",
    "title": "Angular Smart Panel Component | Expand, Collapse, Fullscreen & Hide/Show",
    "description": "A flexible Angular Smart Panel component with expand/collapse behavior, fullscreen mode, hide/show toggle, and smooth UI transitions. Perfect for dashboards, admin panels, and advanced layouts.",
    "keywords": "angular smart panel, angular collapsible panel, expandable panel angular, angular full screen panel, angular hide show panel, collapsible card angular, angular ui panel component, toggle panel angular, angular panel widget, angular resizable panelr"
  }
]
